tutorials/bladeMachines/extend-4.0/steadyCompressibleMRFFoam/bentRotorStator/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (100 0 0);

boundaryField
{
    inlet
    {
        type            pressureInletVelocity;
        value           uniform (100 0 0);
    }

    outlet
    {
        type           inletOutlet;
        inletValue     uniform (0 0 0);
        value          $internalField;
    }

    bladeRotor
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    shaftRotor
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    shroudRotor
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    bladeStator
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    shaftStator
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    shroudStator
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    frontAndBack
    {
        type            cyclic;
    }
}


// ************************************************************************* //
