tutorials/bladeMachines/extend-4.0/steadyCompressibleMRFFoam/bentRotorStator/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         none;

    ddt(rho,U)      steadyState;
    ddt(rho,i)      steadyState;
    ddt(psi,p)      steadyState;

    ddt(rho,k)        steadyState;
    ddt(rho,epsilon)  steadyState;

    U               steadyState;
    T               steadyState;
    p               steadyState;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default          none;
    div(phi,U)       Gauss upwind;
    div(phi,i)       Gauss upwind;
    div(phid,p)      Gauss upwind;

//     div(phi,U)       Gauss vanLeerDC;
//     div(phi,h)       Gauss vanLeerDC;
//     div(phid,p)      Gauss vanLeerDC;

    div(phi,k)       Gauss upwind;
    div(phi,epsilon) Gauss upwind;
    div((muEff*dev2(T(grad(U))))) Gauss linear;

    div(U,p)       Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}


// ************************************************************************* //
